content-org/all-posts.org
#+setupfile: setup.org
#+hugo_section: post
#+seq_todo: TODO DRAFT DONE
#+hugo_front_matter_key_replace: lastmod>mylastmod
#+hugo_front_matter_format: yaml
#+macro: unsplash @@hugo:{{< unsplash leading="$1" id="$2" name="$3" >}}@@
#+macro: pixabay @@hugo:{{< pixabay >}}$1{{< /pixabay >}}@@
#+macro: pexels @@hugo:{{< pexels leading="$1" id="$2" name="$3">}}@@
#+macro: lastmod @@hugo:{{< lastmod >}}@@
#+macro: begin_callout @@hugo:{{% callout $1 %}}@@
#+macro: end_callout @@hugo:{{% /callout %}}@@
#+macro: toc @@html:{{< toc >}}@@

** DONE Academic 4.8.0 から Wowchemy 5.0.0 へのアップデート記録
CLOSED: [2021-02-28 日 00:37]
:PROPERTIES:
:EXPORT_FILE_NAME: index
:EXPORT_DATE: 2021-02-27
:DIR:      images/2021-02-27_academic4-to-wowchemy5
:EXPORT_HUGO_BUNDLE: 2021-02-27_academic4-to-wowchemy5
:EXPORT_HUGO_SLUG: academic4-to-wowchemy5
:END:

#+toc: headlines 2

*** 背景

2021年2月25日に Wowchemy (旧 Academic) の 5.0.0 正式版が[[https://wowchemy.com/blog/v5.0.0/][発表された]]。
4.8 が2020年3月だったので、実に1年ぶりのアップデートとなる。

Academic から Wowchemy にリブランディングされただけではなく、
後方互換性の無い大幅な変更が行われている。

*** アップデート手順

公式には [[https://wowchemy.com/blog/v5.0.0-beta.0/][Beta 0]]、[[https://wowchemy.com/blog/v5.0.0-beta.1/][Beta 1]]、[[https://wowchemy.com/blog/v5.0.0-beta.2/][Beta 2]]、[[https://wowchemy.com/blog/v5.0.0-beta.3/][Beta 3]] を順に辿るとよい、
とあるものの、実際のところ先の変更が後で無意味になったりしたので、
改めてまとめる。

まず、最大の変更点である [[https://gohugo.io/hugo-modules/][Hugo Modules]] への対応。

1.13 以上の go をインストールした後に、
Wowchemy が対応しているバージョンの Hugo を入れる。

これがパッと分からなかったのだけれど、
[[https://wowchemy.com/blog/v5.0.0-beta.3/][Beta 3 のリリースノート]] から Hugo 0.80.0 が最新動作確認版であることが分かり、
また git 上で [[https://github.com/wowchemy/wowchemy-hugo-modules/tree/v5.0.0][5.0.0]] と [[https://github.com/wowchemy/wowchemy-hugo-modules/tree/v5.0.0-beta.3][Beta 3]] の指す先が同じであることから、
5.0.0 でも Hugo 0.80.0 が使えることが分かった。

例によって extended 版が必要なので、
もし arm 版が欲しい場合は https://github.com/gohugoio/hugo/tree/v0.80.0 から zip をダウンロードしたのちに
自身でビルドする必要がある:

#+begin_src sh
go build --tags extended
#+end_src

用意が出来たら、従来のテーマを削除する:

#+begin_src sh
git submodule deinit themes/academic
git rm themes
#+end_src

そして、 =config/_default/config.toml= から =theme = "academic"= の記述を削除し、
以下を最下部に追加する:

#+begin_src toml
[module]
  [[module.imports]]
    path = "github.com/wowchemy/wowchemy-hugo-modules/wowchemy-cms"
  [[module.imports]]
    path = "github.com/wowchemy/wowchemy-hugo-modules/wowchemy"
#+end_src

その後に、モジュールを初期化する:

#+begin_src sh
hugo mod init github.com/yewton/yewton.net
#+end_src

これだと開発版が入ってしまうため、特定バージョンを入れ直す。

Wowchemy のドキュメントにはコミットハッシュ指定で入れるように書いてあるので、
何でバージョン指定出来ないんだろう、と思い調べてみたところ、
どうやらバージョン指定で入れられるようなモジュール設定になっていないらしかった
(参考: [[https://devlights.hatenablog.com/entry/2019/12/20/132730][Goメモ-35 (モジュールのメジャーバージョンを２以降にした場合の取り扱い方について) - いろいろ備忘録日記]] )。

というわけで 5.0.0 のコミットを指定して入れる…と、
ここで罠があって、 *コメント機能を使っている場合、以下の不具合の為にエラーになる* :

[[https://github.com/wowchemy/wowchemy-hugo-modules/pull/2165][fix: comment provider never found by arhohuttunen · Pull Request #2165 · wowchemy/wowchemy-hugo-modules]]

そのため、この修正が取り込まれたコミットを指定してやる:

#+begin_src sh
hugo mod clean
hugo mod get github.com/wowchemy/wowchemy-hugo-modules/wowchemy@3cf9f6c
hugo mod get github.com/wowchemy/wowchemy-hugo-modules/wowchemy-cms@3cf9f6c
hugo mod tidy
#+end_src

画像置き場が =/static/img/= =/static/media/= に変わるので、
合わせてリネーム+置換を行う。
自分は [[https://github.com/dajva/rg.el][rg.el]] の wgrep でシュッとやってしまった。

以降、細かい非互換変更への対応。

=content/authors/admin/_index.md= の =name= を =title= に置換する。

=config/_default/params.toml= に以下を追加する:

#+begin_src toml
# Content Management System
[cms]
 # Enable the admin panel. See https://wowchemy.com/docs/install/
 branch = "master"
 local_backend = false

# Icon Pack Extensions
[icon.pack]
 ai = true  # Enable the Academicons icon pack https://jpswalsh.github.io/academicons/
#+end_src

また、 =search=, =comments=, =map= の設定キー =engine= が =provider= に変わり、
また設定値が数値から文字列に変わっている。これもそれぞれ変更が必要。

記事中での =alert= ショートコードが非推奨になるので、 =callout= に一括置換。

以上で移行は完了した。

*** (おまけ)Chromebook でローカルサーバーにアクセス出来ないとき

[[https://chromebooker.net/topics/qzy312ksxc/][Chromebookでローカルサーバーを立てる | Chromebook情報ポータル「chromebooker」]] にある通り、
=localhost= でアクセス出来るときもあるのだけれど、出来なくなる場合もある
(たぶん初回だけアクセス出来る？)。

そんな時は昔ながらの http://penguin.linux.test:1313/ でアクセスすれば良いのだけれど、
デフォルトでは hugo server は =127.0.0.1= にバインドしているのでそのままでは拒否される。

以下のように全アクセスを許可してやれば良い(信頼出来るネットワークなら):

#+begin_src sh
hugo server -DF --bind 0.0.0.0
#+end_src

*** 終わりに

終わってみれば、大した手間もかからずに移行出来た。

とはいえ、公式ドキュメントだけだと若干引っ掛かる部分もあったので、
この記録が誰かの役に立てば幸い。

